In [2]:
import numpy as np
import pandas as pd

In [3]:
sozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Oğuz"], 
           "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
          "Kalori" : [100,200,300,400]}

In [13]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [14]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Oğuz  Basketbol     400

In [15]:
sozluk2 = {"Isim" : ["Osman", "Levent", "Atlas", "Fatma"], 
           "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
          "Kalori" : [200,100,50,300]}

In [16]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [17]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [18]:
sozluk3 = {"Isim" : ["Ayşe", "Mahmut", "Duygu", "Nur"], 
           "Spor" : ["Koşu", "Yüzme", "Badminton", "Teniz"],
          "Kalori" : [300,400,500,250]}

In [19]:
dataFrame3 = pd.DataFrame(sozluk3,index= [8,9,10,11])

In [20]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Teniz     250

## concatenation

In [27]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Oğuz  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Teniz     250

## merge

In [42]:
mergeSozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Oğuz"],
               "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [43]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [44]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Oğuz  Basketbol

In [45]:
mergeSozluk2 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Oğuz"],
               "Kalori" : [100,200,150,250]}

In [46]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [47]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Oğuz     250

In [49]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Oğuz  Basketbol     250

In [50]:
maasSozluk = {"Isim" : ["Oğuz","Zeynep","Mehmet","Ahmet"],
             "Departman" : ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
             "Maas" : [200,300,400,500]}

In [51]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [52]:
maasDataFrame

     Isim  Departman  Maas
0    Oğuz    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [54]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [62]:
maasDataFrame["Departman"].nunique()

3

In [63]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [64]:
def bruttenNete(maas):
    return maas * 0.66

In [86]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [87]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [97]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
               "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
               "Karakter Yas" : [9,10,50,20,10]
              }

In [98]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [99]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [100]:
karakterDF.pivot_table(values="Karakter Yas", index=["Karakter Sınıfı", "Karakter Ismi"],aggfunc="sum")

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10